Revit 2026 API

# FailureMessageSetAdditionalElement Method

---

Sets the additional reference element for the failure.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public FailureMessage SetAdditionalElement(
	ElementId additionalElement
)
```
```vb
Public Function SetAdditionalElement (
	additionalElement As ElementId
) As FailureMessage
```
```cpp
public:
FailureMessage^ SetAdditionalElement(
	ElementId^ additionalElement
)
```
```fsharp
member SetAdditionalElement :
        additionalElement : ElementId -> FailureMessage
```

#### Parameters

additionalElement ElementId
     The additional element.

#### Return Value

FailureMessage The FailureMessage.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |
| InvalidOperationException | This FailureMessage is already posted to a document |

Additional elements are used to highlight additional information to the user. They are not considered as causing the failure, but are related to it. User cannot delete them in extended error dialog.

#### Reference

FailureMessage Class

Autodesk.Revit.DB Namespace